kitcyte3/bandCode-SES/examples/ble_peripheral/ble_app_hrs_nrf51_ses/main.c
      //our_service_init (&m_our_service, & cus_init);
      our_service_init2(&m_cus2, &cus_init2);
  
  //Third custom service init
      
      ble_cus_init_t      cus_init3 = {0};
      
      // Initialize CUS Service init structure to zero.
      cus_init3.evt_handler                = on_cus_evt;
      
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init3.custom_value_char_attr_md.cccd_write_perm);
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init3.custom_value_char_attr_md.read_perm);
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init3.custom_value_char_attr_md.write_perm);
     
      //our_service_init (&m_our_service, & cus_init);
      our_service_init3(&m_cus3, &cus_init3);
  
  //Fourth custom service init
      
      ble_cus_init_t      cus_init4 = {0};
      
      // Initialize CUS Service init structure to zero.
      cus_init4.evt_handler                = on_cus_evt;
      
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init4.custom_value_char_attr_md.cccd_write_perm);
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init4.custom_value_char_attr_md.read_perm);
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init4.custom_value_char_attr_md.write_perm);
     
      //our_service_init (&m_our_service, & cus_init);
      our_service_init4(&m_cus4, &cus_init4);
  
  //Fifth custom service init
      
      ble_cus_init_t      cus_init5 = {0};
      
      // Initialize CUS Service init structure to zero.
      cus_init5.evt_handler                = on_cus_evt;
      
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init5.custom_value_char_attr_md.cccd_write_perm);
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init5.custom_value_char_attr_md.read_perm);
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init5.custom_value_char_attr_md.write_perm);
     
      //our_service_init (&m_our_service, & cus_init);
      our_service_init5(&m_cus5, &cus_init5);
  
  //Sixth custom service init
      
      ble_cus_init_t      cus_init6 = {0};
      
      // Initialize CUS Service init structure to zero.
      cus_init6.evt_handler                = on_cus_evt;
      
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init6.custom_value_char_attr_md.cccd_write_perm);
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init6.custom_value_char_attr_md.read_perm);
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init6.custom_value_char_attr_md.write_perm);
     
      //our_service_init (&m_our_service, & cus_init);
      our_service_init6(&m_cus6, &cus_init6);
  
  //Seventh custom service init
      
      ble_cus_init_t      cus_init7 = {0};
      
      // Initialize CUS Service init structure to zero.
      cus_init7.evt_handler                = on_cus_evt;
      
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init7.custom_value_char_attr_md.cccd_write_perm);
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init7.custom_value_char_attr_md.read_perm);
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init7.custom_value_char_attr_md.write_perm);
     
      //our_service_init (&m_our_service, & cus_init);
      our_service_init7(&m_cus7, &cus_init7);
  
  //Eighth custom service init
      
      ble_cus_init_t      cus_init8 = {0};
      
      // Initialize CUS Service init structure to zero.
      cus_init8.evt_handler                = on_cus_evt;
      
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init8.custom_value_char_attr_md.cccd_write_perm);
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init8.custom_value_char_attr_md.read_perm);
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init8.custom_value_char_attr_md.write_perm);
     
      //our_service_init (&m_our_service, & cus_init);
      our_service_init8(&m_cus8, &cus_init8);
    

}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting timers.
 */
static void application_timers_start(void)
{
    /* YOUR_JOB: Start your timers. below is an example of how to start a timer.
       uint32_t err_code;
       err_code = app_timer_start(m_app_timer_id, TIMER_INTERVAL, NULL);
       APP_ERROR_CHECK(err_code); */
       ret_code_t err_code;
       err_code = app_timer_start(m_app_timer_id, TIMER_INTERVAL, NULL);
       APP_ERROR_CHECK(err_code);
        
       app_timer_start(m_fds_init_timer_id, FDS_INIT_INTERVAL, NULL);
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);

    APP_ERROR_CHECK(err_code);

