kitcyte3/bandCode-SES/examples/ble_peripheral/ble_app_hrs_nrf51_ses/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(BLE_ADV_MODE_FAST);

    APP_ERROR_CHECK(err_code);
}

static void UART_init(){
  uint32_t err_code_; // modified uint32_t err_code to uint32_t err_code_
  const app_uart_comm_params_t comm_params =
    {
        9,10,12,11,
        APP_UART_FLOW_CONTROL_ENABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200
    };

  APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_error_handle,
                       APP_IRQ_PRIORITY_LOW,
                       err_code_);

  APP_ERROR_CHECK(err_code_);
}
static void sensors_init(){
  GPIOEXP1_init();
  MUX_init();
  twi_init();
  printf("\r\nFinished twi init: \r\n");
  LEDS_CONFIGURE(LEDS_MASK);
  LEDS_OFF(LEDS_MASK);
  LED_BT_on();
}
/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool     erase_bonds;

    // Initialize.
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    UART_init(); //init UART before sensors for debug messages to print
    sensors_init();
    
  
    timers_init();
    application_timers_start();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    peer_manager_init(erase_bonds);
    if (erase_bonds == true)
    {
        NRF_LOG_INFO("Bonds erased!\r\n");
    }
    /*
    while(fds_init_wait_flag != 1)
    {
      power_manage();
    }

    if(fds_init_wait_flag == 1){
        fds_init_wait_flag = 0; 
    }*/
    
    
    while(m_custom_value <= 1)
    {
      power_manage();
    } 
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("Template started\r\n");
    //application_timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
